app/controllers/headlines_controller.rb

SELECT "headlines".* FROM "headlines"  ORDER BY created_at DESC
---
    def index
		@headlines = Headline.all.order("created_at DESC")

SELECT "categories".* FROM "categories"
---
    def new
        @headline = current_user.headlines.build
        @categories = Category.all.map{ |c| [c.name, c.id] }

INSERT INTO "headlines" ("title", "description", "author", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @headline = current_user.headlines.build(headline_params)
        @headline.category_id = params[:category_id]

        if @headline.save

UPDATE "headlines" SET "title" = ?, "updated_at" = ? WHERE "headlines"."id" = ?  [["title", "FMR MEXICAN PRESIDENT DOUBLES DOWN: ‘I AM NOT PAYING FOR THAT F***** WALL’!!!"], ["updated_at", "2017-01-09 23:07:48.904600"], ["id", 1]]
---
	def update
		if @headline.update(headline_params)

DELETE FROM "headlines" WHERE "headlines"."id" = ?  [["id", 1]]
---
	def destroy
	    @headline.destroy

SELECT  "headlines".* FROM "headlines" WHERE "headlines"."id" = ? LIMIT 1  [["id", 1]]
---
        def find_headline
			@headline = Headline.find(params[:id])